Тестовая_база_ERP_14/src/Documents/МаркировкаТоваровГИСМ/МаркировкаТоваровГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркировкаТоваровГИСМ</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНТовары</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередаче</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюТаможенныхДеклараций</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПроизводственныхЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЗатратНаВыпуск</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеМаркировкиТоваровГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияМаркировки</name>
    <type>
      <types>EnumRef.ОперацииМаркировкиГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСИндивидуализацией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>DefinedType.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеКиЗ</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыЗапасовУказаныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркировкаДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКиЗ</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКиЗ</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТаможенногоОргана</name>
      <type>
        <types>DefinedType.КодТаможенногоОрганаГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрацииДекларации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерДекларации</name>
      <type>
        <types>DefinedType.РегистрационныйНомерДекларацииГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТовараВДекларации</name>
      <type>
        <types>DefinedType.НомерТовараВДекларацииГИСМ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКиЗ</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКиЗ</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТаможенногоОргана</name>
      <type>
        <types>DefinedType.КодТаможенногоОрганаГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрацииДекларации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерДекларации</name>
      <type>
        <types>DefinedType.РегистрационныйНомерДекларацииГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТовараВДекларации</name>
      <type>
        <types>DefinedType.НомерТовараВДекларацииГИСМ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерииКиЗ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Enums/ОперацииМаркировкиГИСМ/ОперацииМаркировкиГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииМаркировкиГИСМ</name>
  <enumValues>
    <name>МаркировкаТоваровВозвращенныхПокупателем</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаТоваровПринятыхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаПроизведеннойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ИдентификацияРанееМаркированнойНаПроизводствеПродукции</name>
  </enumValues>
  <enumValues>
    <name>ИдентификацияРанееМаркированныхПриИмпортеТоваров</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатковНа12082016</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаИмпортированныхТоваров</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/УведомлениеОбИмпортеМаркированныхТоваровГИСМ/УведомлениеОбИмпортеМаркированныхТоваровГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОбИмпортеМаркированныхТоваровГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОбИмпортеГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКиЗ</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКиЗ</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидМеха</name>
      <type>
        <types>CatalogRef.ВидыМехаГИСМ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НомераКиЗ</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Documents/МаркировкаТоваровГИСМ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УведомлениеОбИмпортеМаркированныхТоваровГИСМ") Тогда
		ЗаполнитьМаркировкуТоваровПоУведомлениюОбИмпортеМаркированныхТоваровГИСМ(ДанныеЗаполнения, ЭтотОбъект);
	КонецЕсли;
	
	МаркировкаТоваровГИСМПереопределяемый.ОбработкаЗаполненияМаркировкаТоваров(ДанныеЗаполнения, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ОперацияМаркировки = Перечисления.ОперацииМаркировкиГИСМ.ИдентификацияРанееМаркированнойНаПроизводствеПродукции
		ИЛИ ОперацияМаркировки = Перечисления.ОперацииМаркировкиГИСМ.ИдентификацияРанееМаркированныхПриИмпортеТоваров Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Товары.НоменклатураКиЗ");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ХарактеристикаКиЗ");
		МассивНепроверяемыхРеквизитов.Добавить("КиЗГИСМВид");
		МассивНепроверяемыхРеквизитов.Добавить("КиЗГИСМСпособВыпускаВОборот");
		МассивНепроверяемыхРеквизитов.Добавить("КиЗГИСМРазмер");
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.КодТаможенногоОргана");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаРегистрацииДекларации");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.РегистрационныйНомерДекларации");
	
	Если Не ИнтеграцияГИСМ.ИспользоватьПодразделения() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Подразделение");
	КонецЕсли;
	
	Если ОперацияМаркировки = Перечисления.ОперацииМаркировкиГИСМ.МаркировкаОстатковНа12082016 Тогда
		
		Для каждого СтрокаТЧ Из Товары Цикл
			
			Если ЗначениеЗаполнено(СтрокаТЧ.КодТаможенногоОргана)
				Или ЗначениеЗаполнено(СтрокаТЧ.ДатаРегистрацииДекларации)
				Или ЗначениеЗаполнено(СтрокаТЧ.РегистрационныйНомерДекларации) Тогда
				
				НомерСтроки = СтрокаТЧ.НомерСтроки;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.КодТаможенногоОргана) Тогда
					ТекстОшибки = НСтр("ru = 'В строке %НомерСтроки% списка ""Товары"" не указан ""Код таможенного органа"".';
										|en = '""Customs authority code"" is not specified in line %НомерСтроки% of the Goods list.'");
					ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстОшибки,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", НомерСтроки, "КодТаможенногоОргана"),
						,
						Отказ);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаРегистрацииДекларации) Тогда
					ТекстОшибки = НСтр("ru = 'В строке %НомерСтроки% списка ""Товары"" не указана ""Дата регистрации декларации"".';
										|en = '""Declaration registration date"" is not specified in line %НомерСтроки% of the Goods list.'");
					ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстОшибки,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", НомерСтроки, "ДатаРегистрацииДекларации"),
						,
						Отказ);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.РегистрационныйНомерДекларации) Тогда
					ТекстОшибки = НСтр("ru = 'В строке %НомерСтроки% списка ""Товары"" не указан ""Регистрационный номер декларации"".';
										|en = '""Declaration registration number"" is not specified in line %НомерСтроки% of the Goods list.'");
					ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстОшибки,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", НомерСтроки, "РегистрационныйНомерДекларации"),
						,
						Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	МаркировкаТоваровГИСМПереопределяемый.ОбработкаПроверкиЗаполненияМаркировкаТоваров(Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов, ЭтотОбъект);
	
	МаркировкаТоваровГИСМ.ПроверитьСоответствияGTIN(ЭтотОбъект, Отказ);
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МаркировкаТоваровГИСМПереопределяемый.ПередЗаписьюМаркировкаТоваров(Отказ, РежимЗаписи, РежимПроведения, ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	МаркировкаТоваровГИСМПереопределяемый.ПриКопированииМаркировкаТоваров(ОбъектКопирования, ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	МаркировкаТоваровГИСМПереопределяемый.ОбработкаПроведенияМаркировкаТоваров(Отказ, РежимПроведения, ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	МаркировкаТоваровГИСМПереопределяемый.ОбработкаУдаленияПроведенияМаркировкаТоваров(Отказ, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура ЗаполнитьМаркировкуТоваровПоУведомлениюОбИмпортеМаркированныхТоваровГИСМ(ДанныеЗаполнения, ДокументОбъект)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	УведомлениеОбИмпорте.Ссылка КАК Ссылка,
	|	УведомлениеОбИмпорте.Организация КАК Организация
	|ИЗ
	|	Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ КАК УведомлениеОбИмпорте
	|ГДЕ
	|	УведомлениеОбИмпорте.Ссылка = &Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УведомлениеОбИмпортеТовары.Номенклатура,
	|	УведомлениеОбИмпортеТовары.Характеристика,
	|	УведомлениеОбИмпортеТовары.Количество
	|ИЗ
	|	Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Товары КАК УведомлениеОбИмпортеТовары
	|ГДЕ
	|	УведомлениеОбИмпортеТовары.Ссылка = &Ссылка
	|");
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Ссылка);
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаШапка = Результат[0].Выбрать();
	ВыборкаШапка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ВыборкаШапка);
	ДокументОбъект.ОперацияМаркировки = Перечисления.ОперацииМаркировкиГИСМ.МаркировкаИмпортированныхТоваров;
	ДокументОбъект.Основание = ДанныеЗаполнения.Ссылка;
	
	ДокументОбъект.Товары.Загрузить(Результат[1].Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
